// Поиск одного элемента
// Задача. Определить, есть ли в массиве элемент с заданным значением x, и, 
// если он есть, найти его номер
#include <stdio.h>

const int N = 5;

int main() {
    int i, X, A[N];
    int success = 0; // флаг: 0 — не найден, 1 — найден

    // Ввод элементов массива
    printf("Введите %d элементов массива:\n", N);
    for (i = 0; i < N; i++) {
        printf("A[%d] = ", i);
        scanf("%d", &A[i]);
    }

    // Ввод искомого элемента
    printf("Введите искомый элемент X: ");
    scanf("%d", &X);

    // Поиск элемента
    for (i = 0; i < N; i++) {
        if (A[i] == X) {
            success = 1;
            break;
        }
    }

    // Вывод результата
    if (success) {
        printf("Элемент %d найден в позиции A[%d]\n", X, i);
    } else {
        printf("Элемент %d не найден\n", X);
    }

    return 0;
}

