#include <stdio.h>
const int N = 10;
// размер массива
main()
{
int i, A[N];
// объ€вление массива
printf("¬ведите массив A\n"); // подсказка дл€ ввода
for ( i = 0; i < N; i ++ ) { // цикл по всем элементам
printf("¬ведите A[%d]> ", i ); // подсказка дл€ ввода A[i]
scanf ("%d", &A[i]); // ввод A[i]
}
for ( i = 0; i < N; i ++ ) // цикл по всем элементам
A[i] = A[i] * 2; // умножить A[i] на 2
printf("\n–езультат:\n");
for ( i = 0; i < N; i ++ ) // цикл по всем элементам
printf("%d ", A[i]); // вывести A[i]
}